MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4685/mcu.h
extern volatile RXF8EIDLbits_t RXF8EIDLbits __at(0xD6B);
// bitfield macros
#define _RXF8EIDL_EID0_POSN                                 0x0
#define _RXF8EIDL_EID0_POSITION                             0x0
#define _RXF8EIDL_EID0_SIZE                                 0x1
#define _RXF8EIDL_EID0_LENGTH                               0x1
#define _RXF8EIDL_EID0_MASK                                 0x1
#define _RXF8EIDL_EID1_POSN                                 0x1
#define _RXF8EIDL_EID1_POSITION                             0x1
#define _RXF8EIDL_EID1_SIZE                                 0x1
#define _RXF8EIDL_EID1_LENGTH                               0x1
#define _RXF8EIDL_EID1_MASK                                 0x2
#define _RXF8EIDL_EID2_POSN                                 0x2
#define _RXF8EIDL_EID2_POSITION                             0x2
#define _RXF8EIDL_EID2_SIZE                                 0x1
#define _RXF8EIDL_EID2_LENGTH                               0x1
#define _RXF8EIDL_EID2_MASK                                 0x4
#define _RXF8EIDL_EID3_POSN                                 0x3
#define _RXF8EIDL_EID3_POSITION                             0x3
#define _RXF8EIDL_EID3_SIZE                                 0x1
#define _RXF8EIDL_EID3_LENGTH                               0x1
#define _RXF8EIDL_EID3_MASK                                 0x8
#define _RXF8EIDL_EID4_POSN                                 0x4
#define _RXF8EIDL_EID4_POSITION                             0x4
#define _RXF8EIDL_EID4_SIZE                                 0x1
#define _RXF8EIDL_EID4_LENGTH                               0x1
#define _RXF8EIDL_EID4_MASK                                 0x10
#define _RXF8EIDL_EID5_POSN                                 0x5
#define _RXF8EIDL_EID5_POSITION                             0x5
#define _RXF8EIDL_EID5_SIZE                                 0x1
#define _RXF8EIDL_EID5_LENGTH                               0x1
#define _RXF8EIDL_EID5_MASK                                 0x20
#define _RXF8EIDL_EID6_POSN                                 0x6
#define _RXF8EIDL_EID6_POSITION                             0x6
#define _RXF8EIDL_EID6_SIZE                                 0x1
#define _RXF8EIDL_EID6_LENGTH                               0x1
#define _RXF8EIDL_EID6_MASK                                 0x40
#define _RXF8EIDL_EID7_POSN                                 0x7
#define _RXF8EIDL_EID7_POSITION                             0x7
#define _RXF8EIDL_EID7_SIZE                                 0x1
#define _RXF8EIDL_EID7_LENGTH                               0x1
#define _RXF8EIDL_EID7_MASK                                 0x80
#define _RXF8EIDL_RXF8EID0_POSN                             0x0
#define _RXF8EIDL_RXF8EID0_POSITION                         0x0
#define _RXF8EIDL_RXF8EID0_SIZE                             0x1
#define _RXF8EIDL_RXF8EID0_LENGTH                           0x1
#define _RXF8EIDL_RXF8EID0_MASK                             0x1
#define _RXF8EIDL_RXF8EID1_POSN                             0x1
#define _RXF8EIDL_RXF8EID1_POSITION                         0x1
#define _RXF8EIDL_RXF8EID1_SIZE                             0x1
#define _RXF8EIDL_RXF8EID1_LENGTH                           0x1
#define _RXF8EIDL_RXF8EID1_MASK                             0x2
#define _RXF8EIDL_RXF8EID2_POSN                             0x2
#define _RXF8EIDL_RXF8EID2_POSITION                         0x2
#define _RXF8EIDL_RXF8EID2_SIZE                             0x1
#define _RXF8EIDL_RXF8EID2_LENGTH                           0x1
#define _RXF8EIDL_RXF8EID2_MASK                             0x4
#define _RXF8EIDL_RXF8EID3_POSN                             0x3
#define _RXF8EIDL_RXF8EID3_POSITION                         0x3
#define _RXF8EIDL_RXF8EID3_SIZE                             0x1
#define _RXF8EIDL_RXF8EID3_LENGTH                           0x1
#define _RXF8EIDL_RXF8EID3_MASK                             0x8
#define _RXF8EIDL_RXF8EID4_POSN                             0x4
#define _RXF8EIDL_RXF8EID4_POSITION                         0x4
#define _RXF8EIDL_RXF8EID4_SIZE                             0x1
#define _RXF8EIDL_RXF8EID4_LENGTH                           0x1
#define _RXF8EIDL_RXF8EID4_MASK                             0x10
#define _RXF8EIDL_RXF8EID5_POSN                             0x5
#define _RXF8EIDL_RXF8EID5_POSITION                         0x5
#define _RXF8EIDL_RXF8EID5_SIZE                             0x1
#define _RXF8EIDL_RXF8EID5_LENGTH                           0x1
#define _RXF8EIDL_RXF8EID5_MASK                             0x20
#define _RXF8EIDL_RXF8EID6_POSN                             0x6
#define _RXF8EIDL_RXF8EID6_POSITION                         0x6
#define _RXF8EIDL_RXF8EID6_SIZE                             0x1
#define _RXF8EIDL_RXF8EID6_LENGTH                           0x1
#define _RXF8EIDL_RXF8EID6_MASK                             0x40
#define _RXF8EIDL_RXF8EID7_POSN                             0x7
#define _RXF8EIDL_RXF8EID7_POSITION                         0x7
#define _RXF8EIDL_RXF8EID7_SIZE                             0x1
#define _RXF8EIDL_RXF8EID7_LENGTH                           0x1
#define _RXF8EIDL_RXF8EID7_MASK                             0x80

// Register: RXF9SIDH
#define RXF9SIDH RXF9SIDH
extern volatile unsigned char           RXF9SIDH            __at(0xD70);
#ifndef _LIB_BUILD
asm("RXF9SIDH equ 0D70h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF9SID3               :1;
        unsigned RXF9SID4               :1;
        unsigned RXF9SID5               :1;
        unsigned RXF9SID6               :1;
        unsigned RXF9SID7               :1;
        unsigned RXF9SID8               :1;
        unsigned RXF9SID9               :1;
        unsigned RXF9SID10              :1;
    };
} RXF9SIDHbits_t;
