MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4685/mcu.h
extern volatile RXF13EIDHbits_t RXF13EIDHbits __at(0xD86);
// bitfield macros
#define _RXF13EIDH_EID8_POSN                                0x0
#define _RXF13EIDH_EID8_POSITION                            0x0
#define _RXF13EIDH_EID8_SIZE                                0x1
#define _RXF13EIDH_EID8_LENGTH                              0x1
#define _RXF13EIDH_EID8_MASK                                0x1
#define _RXF13EIDH_EID9_POSN                                0x1
#define _RXF13EIDH_EID9_POSITION                            0x1
#define _RXF13EIDH_EID9_SIZE                                0x1
#define _RXF13EIDH_EID9_LENGTH                              0x1
#define _RXF13EIDH_EID9_MASK                                0x2
#define _RXF13EIDH_EID10_POSN                               0x2
#define _RXF13EIDH_EID10_POSITION                           0x2
#define _RXF13EIDH_EID10_SIZE                               0x1
#define _RXF13EIDH_EID10_LENGTH                             0x1
#define _RXF13EIDH_EID10_MASK                               0x4
#define _RXF13EIDH_EID11_POSN                               0x3
#define _RXF13EIDH_EID11_POSITION                           0x3
#define _RXF13EIDH_EID11_SIZE                               0x1
#define _RXF13EIDH_EID11_LENGTH                             0x1
#define _RXF13EIDH_EID11_MASK                               0x8
#define _RXF13EIDH_EID12_POSN                               0x4
#define _RXF13EIDH_EID12_POSITION                           0x4
#define _RXF13EIDH_EID12_SIZE                               0x1
#define _RXF13EIDH_EID12_LENGTH                             0x1
#define _RXF13EIDH_EID12_MASK                               0x10
#define _RXF13EIDH_EID13_POSN                               0x5
#define _RXF13EIDH_EID13_POSITION                           0x5
#define _RXF13EIDH_EID13_SIZE                               0x1
#define _RXF13EIDH_EID13_LENGTH                             0x1
#define _RXF13EIDH_EID13_MASK                               0x20
#define _RXF13EIDH_EID14_POSN                               0x6
#define _RXF13EIDH_EID14_POSITION                           0x6
#define _RXF13EIDH_EID14_SIZE                               0x1
#define _RXF13EIDH_EID14_LENGTH                             0x1
#define _RXF13EIDH_EID14_MASK                               0x40
#define _RXF13EIDH_EID15_POSN                               0x7
#define _RXF13EIDH_EID15_POSITION                           0x7
#define _RXF13EIDH_EID15_SIZE                               0x1
#define _RXF13EIDH_EID15_LENGTH                             0x1
#define _RXF13EIDH_EID15_MASK                               0x80
#define _RXF13EIDH_RXF13EID8_POSN                           0x0
#define _RXF13EIDH_RXF13EID8_POSITION                       0x0
#define _RXF13EIDH_RXF13EID8_SIZE                           0x1
#define _RXF13EIDH_RXF13EID8_LENGTH                         0x1
#define _RXF13EIDH_RXF13EID8_MASK                           0x1
#define _RXF13EIDH_RXF13EID9_POSN                           0x1
#define _RXF13EIDH_RXF13EID9_POSITION                       0x1
#define _RXF13EIDH_RXF13EID9_SIZE                           0x1
#define _RXF13EIDH_RXF13EID9_LENGTH                         0x1
#define _RXF13EIDH_RXF13EID9_MASK                           0x2
#define _RXF13EIDH_RXF13EID10_POSN                          0x2
#define _RXF13EIDH_RXF13EID10_POSITION                      0x2
#define _RXF13EIDH_RXF13EID10_SIZE                          0x1
#define _RXF13EIDH_RXF13EID10_LENGTH                        0x1
#define _RXF13EIDH_RXF13EID10_MASK                          0x4
#define _RXF13EIDH_RXF13EID11_POSN                          0x3
#define _RXF13EIDH_RXF13EID11_POSITION                      0x3
#define _RXF13EIDH_RXF13EID11_SIZE                          0x1
#define _RXF13EIDH_RXF13EID11_LENGTH                        0x1
#define _RXF13EIDH_RXF13EID11_MASK                          0x8
#define _RXF13EIDH_RXF13EID12_POSN                          0x4
#define _RXF13EIDH_RXF13EID12_POSITION                      0x4
#define _RXF13EIDH_RXF13EID12_SIZE                          0x1
#define _RXF13EIDH_RXF13EID12_LENGTH                        0x1
#define _RXF13EIDH_RXF13EID12_MASK                          0x10
#define _RXF13EIDH_RXF13EID13_POSN                          0x5
#define _RXF13EIDH_RXF13EID13_POSITION                      0x5
#define _RXF13EIDH_RXF13EID13_SIZE                          0x1
#define _RXF13EIDH_RXF13EID13_LENGTH                        0x1
#define _RXF13EIDH_RXF13EID13_MASK                          0x20
#define _RXF13EIDH_RXF13EID14_POSN                          0x6
#define _RXF13EIDH_RXF13EID14_POSITION                      0x6
#define _RXF13EIDH_RXF13EID14_SIZE                          0x1
#define _RXF13EIDH_RXF13EID14_LENGTH                        0x1
#define _RXF13EIDH_RXF13EID14_MASK                          0x40
#define _RXF13EIDH_RXF13EID15_POSN                          0x7
#define _RXF13EIDH_RXF13EID15_POSITION                      0x7
#define _RXF13EIDH_RXF13EID15_SIZE                          0x1
#define _RXF13EIDH_RXF13EID15_LENGTH                        0x1
#define _RXF13EIDH_RXF13EID15_MASK                          0x80

// Register: RXF13EIDL
#define RXF13EIDL RXF13EIDL
extern volatile unsigned char           RXF13EIDL           __at(0xD87);
#ifndef _LIB_BUILD
asm("RXF13EIDL equ 0D87h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF13EID0              :1;
        unsigned RXF13EID1              :1;
        unsigned RXF13EID2              :1;
        unsigned RXF13EID3              :1;
        unsigned RXF13EID4              :1;
        unsigned RXF13EID5              :1;
        unsigned RXF13EID6              :1;
        unsigned RXF13EID7              :1;
    };
} RXF13EIDLbits_t;
extern volatile RXF13EIDLbits_t RXF13EIDLbits __at(0xD87);
// bitfield macros
#define _RXF13EIDL_EID0_POSN                                0x0
#define _RXF13EIDL_EID0_POSITION                            0x0
#define _RXF13EIDL_EID0_SIZE                                0x1
#define _RXF13EIDL_EID0_LENGTH                              0x1
#define _RXF13EIDL_EID0_MASK                                0x1
#define _RXF13EIDL_EID1_POSN                                0x1
#define _RXF13EIDL_EID1_POSITION                            0x1
#define _RXF13EIDL_EID1_SIZE                                0x1
#define _RXF13EIDL_EID1_LENGTH                              0x1
#define _RXF13EIDL_EID1_MASK                                0x2
#define _RXF13EIDL_EID2_POSN                                0x2
#define _RXF13EIDL_EID2_POSITION                            0x2
#define _RXF13EIDL_EID2_SIZE                                0x1
#define _RXF13EIDL_EID2_LENGTH                              0x1
#define _RXF13EIDL_EID2_MASK                                0x4
#define _RXF13EIDL_EID3_POSN                                0x3
#define _RXF13EIDL_EID3_POSITION                            0x3
#define _RXF13EIDL_EID3_SIZE                                0x1
#define _RXF13EIDL_EID3_LENGTH                              0x1
#define _RXF13EIDL_EID3_MASK                                0x8
#define _RXF13EIDL_EID4_POSN                                0x4
#define _RXF13EIDL_EID4_POSITION                            0x4
#define _RXF13EIDL_EID4_SIZE                                0x1
#define _RXF13EIDL_EID4_LENGTH                              0x1
#define _RXF13EIDL_EID4_MASK                                0x10
#define _RXF13EIDL_EID5_POSN                                0x5
#define _RXF13EIDL_EID5_POSITION                            0x5
#define _RXF13EIDL_EID5_SIZE                                0x1
#define _RXF13EIDL_EID5_LENGTH                              0x1
#define _RXF13EIDL_EID5_MASK                                0x20
#define _RXF13EIDL_EID6_POSN                                0x6
#define _RXF13EIDL_EID6_POSITION                            0x6
#define _RXF13EIDL_EID6_SIZE                                0x1
#define _RXF13EIDL_EID6_LENGTH                              0x1
#define _RXF13EIDL_EID6_MASK                                0x40
#define _RXF13EIDL_EID7_POSN                                0x7
#define _RXF13EIDL_EID7_POSITION                            0x7
#define _RXF13EIDL_EID7_SIZE                                0x1
#define _RXF13EIDL_EID7_LENGTH                              0x1
#define _RXF13EIDL_EID7_MASK                                0x80
#define _RXF13EIDL_RXF13EID0_POSN                           0x0
#define _RXF13EIDL_RXF13EID0_POSITION                       0x0
#define _RXF13EIDL_RXF13EID0_SIZE                           0x1
#define _RXF13EIDL_RXF13EID0_LENGTH                         0x1
#define _RXF13EIDL_RXF13EID0_MASK                           0x1
#define _RXF13EIDL_RXF13EID1_POSN                           0x1
#define _RXF13EIDL_RXF13EID1_POSITION                       0x1
#define _RXF13EIDL_RXF13EID1_SIZE                           0x1
#define _RXF13EIDL_RXF13EID1_LENGTH                         0x1
#define _RXF13EIDL_RXF13EID1_MASK                           0x2
#define _RXF13EIDL_RXF13EID2_POSN                           0x2
#define _RXF13EIDL_RXF13EID2_POSITION                       0x2
#define _RXF13EIDL_RXF13EID2_SIZE                           0x1
#define _RXF13EIDL_RXF13EID2_LENGTH                         0x1
#define _RXF13EIDL_RXF13EID2_MASK                           0x4
#define _RXF13EIDL_RXF13EID3_POSN                           0x3
#define _RXF13EIDL_RXF13EID3_POSITION                       0x3
#define _RXF13EIDL_RXF13EID3_SIZE                           0x1
#define _RXF13EIDL_RXF13EID3_LENGTH                         0x1
#define _RXF13EIDL_RXF13EID3_MASK                           0x8
#define _RXF13EIDL_RXF13EID4_POSN                           0x4
#define _RXF13EIDL_RXF13EID4_POSITION                       0x4
#define _RXF13EIDL_RXF13EID4_SIZE                           0x1
#define _RXF13EIDL_RXF13EID4_LENGTH                         0x1
#define _RXF13EIDL_RXF13EID4_MASK                           0x10
#define _RXF13EIDL_RXF13EID5_POSN                           0x5
#define _RXF13EIDL_RXF13EID5_POSITION                       0x5
#define _RXF13EIDL_RXF13EID5_SIZE                           0x1
#define _RXF13EIDL_RXF13EID5_LENGTH                         0x1
#define _RXF13EIDL_RXF13EID5_MASK                           0x20
#define _RXF13EIDL_RXF13EID6_POSN                           0x6
#define _RXF13EIDL_RXF13EID6_POSITION                       0x6
#define _RXF13EIDL_RXF13EID6_SIZE                           0x1
#define _RXF13EIDL_RXF13EID6_LENGTH                         0x1
#define _RXF13EIDL_RXF13EID6_MASK                           0x40
#define _RXF13EIDL_RXF13EID7_POSN                           0x7
#define _RXF13EIDL_RXF13EID7_POSITION                       0x7
#define _RXF13EIDL_RXF13EID7_SIZE                           0x1
#define _RXF13EIDL_RXF13EID7_LENGTH                         0x1
#define _RXF13EIDL_RXF13EID7_MASK                           0x80

// Register: RXF14SIDH
#define RXF14SIDH RXF14SIDH
extern volatile unsigned char           RXF14SIDH           __at(0xD88);
#ifndef _LIB_BUILD
asm("RXF14SIDH equ 0D88h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF14SID3              :1;
        unsigned RXF14SID4              :1;
        unsigned RXF14SID5              :1;
        unsigned RXF14SID6              :1;
        unsigned RXF14SID7              :1;
        unsigned RXF14SID8              :1;
        unsigned RXF14SID9              :1;
        unsigned RXF14SID10             :1;
    };
} RXF14SIDHbits_t;
extern volatile RXF14SIDHbits_t RXF14SIDHbits __at(0xD88);
// bitfield macros
#define _RXF14SIDH_SID3_POSN                                0x0
#define _RXF14SIDH_SID3_POSITION                            0x0
#define _RXF14SIDH_SID3_SIZE                                0x1
#define _RXF14SIDH_SID3_LENGTH                              0x1
#define _RXF14SIDH_SID3_MASK                                0x1
#define _RXF14SIDH_SID4_POSN                                0x1
#define _RXF14SIDH_SID4_POSITION                            0x1
#define _RXF14SIDH_SID4_SIZE                                0x1
#define _RXF14SIDH_SID4_LENGTH                              0x1
#define _RXF14SIDH_SID4_MASK                                0x2
#define _RXF14SIDH_SID5_POSN                                0x2
#define _RXF14SIDH_SID5_POSITION                            0x2
#define _RXF14SIDH_SID5_SIZE                                0x1
#define _RXF14SIDH_SID5_LENGTH                              0x1
#define _RXF14SIDH_SID5_MASK                                0x4
#define _RXF14SIDH_SID6_POSN                                0x3
#define _RXF14SIDH_SID6_POSITION                            0x3
#define _RXF14SIDH_SID6_SIZE                                0x1
#define _RXF14SIDH_SID6_LENGTH                              0x1
#define _RXF14SIDH_SID6_MASK                                0x8
#define _RXF14SIDH_SID7_POSN                                0x4
#define _RXF14SIDH_SID7_POSITION                            0x4
#define _RXF14SIDH_SID7_SIZE                                0x1
#define _RXF14SIDH_SID7_LENGTH                              0x1
#define _RXF14SIDH_SID7_MASK                                0x10
#define _RXF14SIDH_SID8_POSN                                0x5
#define _RXF14SIDH_SID8_POSITION                            0x5
#define _RXF14SIDH_SID8_SIZE                                0x1
#define _RXF14SIDH_SID8_LENGTH                              0x1
#define _RXF14SIDH_SID8_MASK                                0x20
#define _RXF14SIDH_SID9_POSN                                0x6
#define _RXF14SIDH_SID9_POSITION                            0x6
#define _RXF14SIDH_SID9_SIZE                                0x1
#define _RXF14SIDH_SID9_LENGTH                              0x1
#define _RXF14SIDH_SID9_MASK                                0x40
#define _RXF14SIDH_SID10_POSN                               0x7
#define _RXF14SIDH_SID10_POSITION                           0x7
#define _RXF14SIDH_SID10_SIZE                               0x1
#define _RXF14SIDH_SID10_LENGTH                             0x1
#define _RXF14SIDH_SID10_MASK                               0x80
#define _RXF14SIDH_RXF14SID3_POSN                           0x0
#define _RXF14SIDH_RXF14SID3_POSITION                       0x0
#define _RXF14SIDH_RXF14SID3_SIZE                           0x1
#define _RXF14SIDH_RXF14SID3_LENGTH                         0x1
#define _RXF14SIDH_RXF14SID3_MASK                           0x1
#define _RXF14SIDH_RXF14SID4_POSN                           0x1
#define _RXF14SIDH_RXF14SID4_POSITION                       0x1
#define _RXF14SIDH_RXF14SID4_SIZE                           0x1
#define _RXF14SIDH_RXF14SID4_LENGTH                         0x1
#define _RXF14SIDH_RXF14SID4_MASK                           0x2
#define _RXF14SIDH_RXF14SID5_POSN                           0x2
#define _RXF14SIDH_RXF14SID5_POSITION                       0x2
#define _RXF14SIDH_RXF14SID5_SIZE                           0x1
#define _RXF14SIDH_RXF14SID5_LENGTH                         0x1
#define _RXF14SIDH_RXF14SID5_MASK                           0x4
#define _RXF14SIDH_RXF14SID6_POSN                           0x3
#define _RXF14SIDH_RXF14SID6_POSITION                       0x3
#define _RXF14SIDH_RXF14SID6_SIZE                           0x1
#define _RXF14SIDH_RXF14SID6_LENGTH                         0x1
#define _RXF14SIDH_RXF14SID6_MASK                           0x8
#define _RXF14SIDH_RXF14SID7_POSN                           0x4
#define _RXF14SIDH_RXF14SID7_POSITION                       0x4
#define _RXF14SIDH_RXF14SID7_SIZE                           0x1
#define _RXF14SIDH_RXF14SID7_LENGTH                         0x1
#define _RXF14SIDH_RXF14SID7_MASK                           0x10
#define _RXF14SIDH_RXF14SID8_POSN                           0x5
#define _RXF14SIDH_RXF14SID8_POSITION                       0x5
#define _RXF14SIDH_RXF14SID8_SIZE                           0x1
#define _RXF14SIDH_RXF14SID8_LENGTH                         0x1
#define _RXF14SIDH_RXF14SID8_MASK                           0x20
#define _RXF14SIDH_RXF14SID9_POSN                           0x6
#define _RXF14SIDH_RXF14SID9_POSITION                       0x6
#define _RXF14SIDH_RXF14SID9_SIZE                           0x1
#define _RXF14SIDH_RXF14SID9_LENGTH                         0x1
#define _RXF14SIDH_RXF14SID9_MASK                           0x40
#define _RXF14SIDH_RXF14SID10_POSN                          0x7
#define _RXF14SIDH_RXF14SID10_POSITION                      0x7
#define _RXF14SIDH_RXF14SID10_SIZE                          0x1
#define _RXF14SIDH_RXF14SID10_LENGTH                        0x1
#define _RXF14SIDH_RXF14SID10_MASK                          0x80

