MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4685/mcu.h
extern volatile B0D2bits_t B0D2bits __at(0xE28);
// bitfield macros
#define _B0D2_B0D20_POSN                                    0x0
#define _B0D2_B0D20_POSITION                                0x0
#define _B0D2_B0D20_SIZE                                    0x1
#define _B0D2_B0D20_LENGTH                                  0x1
#define _B0D2_B0D20_MASK                                    0x1
#define _B0D2_B0D21_POSN                                    0x1
#define _B0D2_B0D21_POSITION                                0x1
#define _B0D2_B0D21_SIZE                                    0x1
#define _B0D2_B0D21_LENGTH                                  0x1
#define _B0D2_B0D21_MASK                                    0x2
#define _B0D2_B0D22_POSN                                    0x2
#define _B0D2_B0D22_POSITION                                0x2
#define _B0D2_B0D22_SIZE                                    0x1
#define _B0D2_B0D22_LENGTH                                  0x1
#define _B0D2_B0D22_MASK                                    0x4
#define _B0D2_B0D23_POSN                                    0x3
#define _B0D2_B0D23_POSITION                                0x3
#define _B0D2_B0D23_SIZE                                    0x1
#define _B0D2_B0D23_LENGTH                                  0x1
#define _B0D2_B0D23_MASK                                    0x8
#define _B0D2_B0D24_POSN                                    0x4
#define _B0D2_B0D24_POSITION                                0x4
#define _B0D2_B0D24_SIZE                                    0x1
#define _B0D2_B0D24_LENGTH                                  0x1
#define _B0D2_B0D24_MASK                                    0x10
#define _B0D2_B0D25_POSN                                    0x5
#define _B0D2_B0D25_POSITION                                0x5
#define _B0D2_B0D25_SIZE                                    0x1
#define _B0D2_B0D25_LENGTH                                  0x1
#define _B0D2_B0D25_MASK                                    0x20
#define _B0D2_B0D26_POSN                                    0x6
#define _B0D2_B0D26_POSITION                                0x6
#define _B0D2_B0D26_SIZE                                    0x1
#define _B0D2_B0D26_LENGTH                                  0x1
#define _B0D2_B0D26_MASK                                    0x40
#define _B0D2_B0D27_POSN                                    0x7
#define _B0D2_B0D27_POSITION                                0x7
#define _B0D2_B0D27_SIZE                                    0x1
#define _B0D2_B0D27_LENGTH                                  0x1
#define _B0D2_B0D27_MASK                                    0x80

// Register: B0D3
#define B0D3 B0D3
extern volatile unsigned char           B0D3                __at(0xE29);
#ifndef _LIB_BUILD
asm("B0D3 equ 0E29h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B0D30                  :1;
        unsigned B0D31                  :1;
        unsigned B0D32                  :1;
        unsigned B0D33                  :1;
        unsigned B0D34                  :1;
        unsigned B0D35                  :1;
        unsigned B0D36                  :1;
        unsigned B0D37                  :1;
    };
} B0D3bits_t;
extern volatile B0D3bits_t B0D3bits __at(0xE29);
// bitfield macros
#define _B0D3_B0D30_POSN                                    0x0
#define _B0D3_B0D30_POSITION                                0x0
#define _B0D3_B0D30_SIZE                                    0x1
#define _B0D3_B0D30_LENGTH                                  0x1
#define _B0D3_B0D30_MASK                                    0x1
#define _B0D3_B0D31_POSN                                    0x1
#define _B0D3_B0D31_POSITION                                0x1
#define _B0D3_B0D31_SIZE                                    0x1
#define _B0D3_B0D31_LENGTH                                  0x1
#define _B0D3_B0D31_MASK                                    0x2
#define _B0D3_B0D32_POSN                                    0x2
#define _B0D3_B0D32_POSITION                                0x2
#define _B0D3_B0D32_SIZE                                    0x1
#define _B0D3_B0D32_LENGTH                                  0x1
#define _B0D3_B0D32_MASK                                    0x4
#define _B0D3_B0D33_POSN                                    0x3
#define _B0D3_B0D33_POSITION                                0x3
#define _B0D3_B0D33_SIZE                                    0x1
#define _B0D3_B0D33_LENGTH                                  0x1
#define _B0D3_B0D33_MASK                                    0x8
#define _B0D3_B0D34_POSN                                    0x4
#define _B0D3_B0D34_POSITION                                0x4
#define _B0D3_B0D34_SIZE                                    0x1
#define _B0D3_B0D34_LENGTH                                  0x1
#define _B0D3_B0D34_MASK                                    0x10
#define _B0D3_B0D35_POSN                                    0x5
#define _B0D3_B0D35_POSITION                                0x5
#define _B0D3_B0D35_SIZE                                    0x1
#define _B0D3_B0D35_LENGTH                                  0x1
#define _B0D3_B0D35_MASK                                    0x20
#define _B0D3_B0D36_POSN                                    0x6
#define _B0D3_B0D36_POSITION                                0x6
#define _B0D3_B0D36_SIZE                                    0x1
#define _B0D3_B0D36_LENGTH                                  0x1
#define _B0D3_B0D36_MASK                                    0x40
#define _B0D3_B0D37_POSN                                    0x7
#define _B0D3_B0D37_POSITION                                0x7
#define _B0D3_B0D37_SIZE                                    0x1
#define _B0D3_B0D37_LENGTH                                  0x1
#define _B0D3_B0D37_MASK                                    0x80

// Register: B0D4
#define B0D4 B0D4
extern volatile unsigned char           B0D4                __at(0xE2A);
#ifndef _LIB_BUILD
asm("B0D4 equ 0E2Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B0D40                  :1;
        unsigned B0D41                  :1;
        unsigned B0D42                  :1;
        unsigned B0D43                  :1;
        unsigned B0D44                  :1;
        unsigned B0D45                  :1;
        unsigned B0D46                  :1;
        unsigned B0D47                  :1;
    };
} B0D4bits_t;
extern volatile B0D4bits_t B0D4bits __at(0xE2A);
// bitfield macros
#define _B0D4_B0D40_POSN                                    0x0
#define _B0D4_B0D40_POSITION                                0x0
#define _B0D4_B0D40_SIZE                                    0x1
#define _B0D4_B0D40_LENGTH                                  0x1
#define _B0D4_B0D40_MASK                                    0x1
#define _B0D4_B0D41_POSN                                    0x1
#define _B0D4_B0D41_POSITION                                0x1
#define _B0D4_B0D41_SIZE                                    0x1
#define _B0D4_B0D41_LENGTH                                  0x1
#define _B0D4_B0D41_MASK                                    0x2
#define _B0D4_B0D42_POSN                                    0x2
#define _B0D4_B0D42_POSITION                                0x2
#define _B0D4_B0D42_SIZE                                    0x1
#define _B0D4_B0D42_LENGTH                                  0x1
#define _B0D4_B0D42_MASK                                    0x4
#define _B0D4_B0D43_POSN                                    0x3
#define _B0D4_B0D43_POSITION                                0x3
#define _B0D4_B0D43_SIZE                                    0x1
#define _B0D4_B0D43_LENGTH                                  0x1
#define _B0D4_B0D43_MASK                                    0x8
#define _B0D4_B0D44_POSN                                    0x4
#define _B0D4_B0D44_POSITION                                0x4
#define _B0D4_B0D44_SIZE                                    0x1
#define _B0D4_B0D44_LENGTH                                  0x1
#define _B0D4_B0D44_MASK                                    0x10
#define _B0D4_B0D45_POSN                                    0x5
#define _B0D4_B0D45_POSITION                                0x5
#define _B0D4_B0D45_SIZE                                    0x1
#define _B0D4_B0D45_LENGTH                                  0x1
#define _B0D4_B0D45_MASK                                    0x20
#define _B0D4_B0D46_POSN                                    0x6
#define _B0D4_B0D46_POSITION                                0x6
#define _B0D4_B0D46_SIZE                                    0x1
#define _B0D4_B0D46_LENGTH                                  0x1
#define _B0D4_B0D46_MASK                                    0x40
#define _B0D4_B0D47_POSN                                    0x7
#define _B0D4_B0D47_POSITION                                0x7
#define _B0D4_B0D47_SIZE                                    0x1
#define _B0D4_B0D47_LENGTH                                  0x1
#define _B0D4_B0D47_MASK                                    0x80

