MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4685/mcu.h
extern volatile TXB1D4bits_t TXB1D4bits __at(0xF3A);
// bitfield macros
#define _TXB1D4_TXB1D40_POSN                                0x0
#define _TXB1D4_TXB1D40_POSITION                            0x0
#define _TXB1D4_TXB1D40_SIZE                                0x1
#define _TXB1D4_TXB1D40_LENGTH                              0x1
#define _TXB1D4_TXB1D40_MASK                                0x1
#define _TXB1D4_TXB1D41_POSN                                0x1
#define _TXB1D4_TXB1D41_POSITION                            0x1
#define _TXB1D4_TXB1D41_SIZE                                0x1
#define _TXB1D4_TXB1D41_LENGTH                              0x1
#define _TXB1D4_TXB1D41_MASK                                0x2
#define _TXB1D4_TXB1D42_POSN                                0x2
#define _TXB1D4_TXB1D42_POSITION                            0x2
#define _TXB1D4_TXB1D42_SIZE                                0x1
#define _TXB1D4_TXB1D42_LENGTH                              0x1
#define _TXB1D4_TXB1D42_MASK                                0x4
#define _TXB1D4_TXB1D43_POSN                                0x3
#define _TXB1D4_TXB1D43_POSITION                            0x3
#define _TXB1D4_TXB1D43_SIZE                                0x1
#define _TXB1D4_TXB1D43_LENGTH                              0x1
#define _TXB1D4_TXB1D43_MASK                                0x8
#define _TXB1D4_TXB1D44_POSN                                0x4
#define _TXB1D4_TXB1D44_POSITION                            0x4
#define _TXB1D4_TXB1D44_SIZE                                0x1
#define _TXB1D4_TXB1D44_LENGTH                              0x1
#define _TXB1D4_TXB1D44_MASK                                0x10
#define _TXB1D4_TXB1D45_POSN                                0x5
#define _TXB1D4_TXB1D45_POSITION                            0x5
#define _TXB1D4_TXB1D45_SIZE                                0x1
#define _TXB1D4_TXB1D45_LENGTH                              0x1
#define _TXB1D4_TXB1D45_MASK                                0x20
#define _TXB1D4_TXB1D46_POSN                                0x6
#define _TXB1D4_TXB1D46_POSITION                            0x6
#define _TXB1D4_TXB1D46_SIZE                                0x1
#define _TXB1D4_TXB1D46_LENGTH                              0x1
#define _TXB1D4_TXB1D46_MASK                                0x40
#define _TXB1D4_TXB1D47_POSN                                0x7
#define _TXB1D4_TXB1D47_POSITION                            0x7
#define _TXB1D4_TXB1D47_SIZE                                0x1
#define _TXB1D4_TXB1D47_LENGTH                              0x1
#define _TXB1D4_TXB1D47_MASK                                0x80

// Register: TXB1D5
#define TXB1D5 TXB1D5
extern volatile unsigned char           TXB1D5              __at(0xF3B);
#ifndef _LIB_BUILD
asm("TXB1D5 equ 0F3Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB1D50                :1;
        unsigned TXB1D51                :1;
        unsigned TXB1D52                :1;
        unsigned TXB1D53                :1;
        unsigned TXB1D54                :1;
        unsigned TXB1D55                :1;
        unsigned TXB1D56                :1;
        unsigned TXB1D57                :1;
    };
} TXB1D5bits_t;
extern volatile TXB1D5bits_t TXB1D5bits __at(0xF3B);
// bitfield macros
#define _TXB1D5_TXB1D50_POSN                                0x0
#define _TXB1D5_TXB1D50_POSITION                            0x0
#define _TXB1D5_TXB1D50_SIZE                                0x1
#define _TXB1D5_TXB1D50_LENGTH                              0x1
#define _TXB1D5_TXB1D50_MASK                                0x1
#define _TXB1D5_TXB1D51_POSN                                0x1
#define _TXB1D5_TXB1D51_POSITION                            0x1
#define _TXB1D5_TXB1D51_SIZE                                0x1
#define _TXB1D5_TXB1D51_LENGTH                              0x1
#define _TXB1D5_TXB1D51_MASK                                0x2
#define _TXB1D5_TXB1D52_POSN                                0x2
#define _TXB1D5_TXB1D52_POSITION                            0x2
#define _TXB1D5_TXB1D52_SIZE                                0x1
#define _TXB1D5_TXB1D52_LENGTH                              0x1
#define _TXB1D5_TXB1D52_MASK                                0x4
#define _TXB1D5_TXB1D53_POSN                                0x3
#define _TXB1D5_TXB1D53_POSITION                            0x3
#define _TXB1D5_TXB1D53_SIZE                                0x1
#define _TXB1D5_TXB1D53_LENGTH                              0x1
#define _TXB1D5_TXB1D53_MASK                                0x8
#define _TXB1D5_TXB1D54_POSN                                0x4
#define _TXB1D5_TXB1D54_POSITION                            0x4
#define _TXB1D5_TXB1D54_SIZE                                0x1
#define _TXB1D5_TXB1D54_LENGTH                              0x1
#define _TXB1D5_TXB1D54_MASK                                0x10
#define _TXB1D5_TXB1D55_POSN                                0x5
#define _TXB1D5_TXB1D55_POSITION                            0x5
#define _TXB1D5_TXB1D55_SIZE                                0x1
#define _TXB1D5_TXB1D55_LENGTH                              0x1
#define _TXB1D5_TXB1D55_MASK                                0x20
#define _TXB1D5_TXB1D56_POSN                                0x6
#define _TXB1D5_TXB1D56_POSITION                            0x6
#define _TXB1D5_TXB1D56_SIZE                                0x1
#define _TXB1D5_TXB1D56_LENGTH                              0x1
#define _TXB1D5_TXB1D56_MASK                                0x40
#define _TXB1D5_TXB1D57_POSN                                0x7
#define _TXB1D5_TXB1D57_POSITION                            0x7
#define _TXB1D5_TXB1D57_SIZE                                0x1
#define _TXB1D5_TXB1D57_LENGTH                              0x1
#define _TXB1D5_TXB1D57_MASK                                0x80

// Register: TXB1D6
#define TXB1D6 TXB1D6
extern volatile unsigned char           TXB1D6              __at(0xF3C);
#ifndef _LIB_BUILD
asm("TXB1D6 equ 0F3Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB1D60                :1;
        unsigned TXB1D61                :1;
        unsigned TXB1D62                :1;
        unsigned TXB1D63                :1;
        unsigned TXB1D64                :1;
        unsigned TXB1D65                :1;
        unsigned TXB1D66                :1;
        unsigned TXB1D67                :1;
    };
} TXB1D6bits_t;
extern volatile TXB1D6bits_t TXB1D6bits __at(0xF3C);
// bitfield macros
#define _TXB1D6_TXB1D60_POSN                                0x0
#define _TXB1D6_TXB1D60_POSITION                            0x0
#define _TXB1D6_TXB1D60_SIZE                                0x1
#define _TXB1D6_TXB1D60_LENGTH                              0x1
#define _TXB1D6_TXB1D60_MASK                                0x1
#define _TXB1D6_TXB1D61_POSN                                0x1
#define _TXB1D6_TXB1D61_POSITION                            0x1
#define _TXB1D6_TXB1D61_SIZE                                0x1
#define _TXB1D6_TXB1D61_LENGTH                              0x1
#define _TXB1D6_TXB1D61_MASK                                0x2
#define _TXB1D6_TXB1D62_POSN                                0x2
#define _TXB1D6_TXB1D62_POSITION                            0x2
#define _TXB1D6_TXB1D62_SIZE                                0x1
#define _TXB1D6_TXB1D62_LENGTH                              0x1
#define _TXB1D6_TXB1D62_MASK                                0x4
#define _TXB1D6_TXB1D63_POSN                                0x3
#define _TXB1D6_TXB1D63_POSITION                            0x3
#define _TXB1D6_TXB1D63_SIZE                                0x1
#define _TXB1D6_TXB1D63_LENGTH                              0x1
#define _TXB1D6_TXB1D63_MASK                                0x8
#define _TXB1D6_TXB1D64_POSN                                0x4
#define _TXB1D6_TXB1D64_POSITION                            0x4
#define _TXB1D6_TXB1D64_SIZE                                0x1
#define _TXB1D6_TXB1D64_LENGTH                              0x1
#define _TXB1D6_TXB1D64_MASK                                0x10
#define _TXB1D6_TXB1D65_POSN                                0x5
#define _TXB1D6_TXB1D65_POSITION                            0x5
#define _TXB1D6_TXB1D65_SIZE                                0x1
#define _TXB1D6_TXB1D65_LENGTH                              0x1
#define _TXB1D6_TXB1D65_MASK                                0x20
#define _TXB1D6_TXB1D66_POSN                                0x6
#define _TXB1D6_TXB1D66_POSITION                            0x6
#define _TXB1D6_TXB1D66_SIZE                                0x1
#define _TXB1D6_TXB1D66_LENGTH                              0x1
#define _TXB1D6_TXB1D66_MASK                                0x40
#define _TXB1D6_TXB1D67_POSN                                0x7
#define _TXB1D6_TXB1D67_POSITION                            0x7
#define _TXB1D6_TXB1D67_SIZE                                0x1
#define _TXB1D6_TXB1D67_LENGTH                              0x1
#define _TXB1D6_TXB1D67_MASK                                0x80

